Ref: https://neptune.ai/blog/the-best-ml-framework-extensions-for-scikit-learn

In [4]:
import pandas as pd
import sklearn

In [5]:
data =pd.DataFrame({
    'Name':['Ken','Jeff','John','Mike','Andrew','Ann','Sylvia','Dorothy','Emily','Loyford'],
    'Age':[31,52,56,12,45,50,78,85,46,135],
    'Phone':[52,79,80,75,43,125,74,44,85,45],
    'Uni':['One','Two','Three','One','Two','Three','One','Two','Three','One']
})

In [6]:
data

      Name  Age  Phone    Uni
0      Ken   31     52    One
1     Jeff   52     79    Two
2     John   56     80  Three
3     Mike   12     75    One
4   Andrew   45     43    Two
5      Ann   50    125  Three
6   Sylvia   78     74    One
7  Dorothy   85     44    Two
8    Emily   46     85  Three
9  Loyford  135     45    One

In [15]:
from sklearn_pandas import DataFrameMapper

mapper = DataFrameMapper([
     (['Uni'], sklearn.preprocessing.LabelBinarizer()),
     (['Age'], sklearn.preprocessing.StandardScaler())
 ], df_out=True)

In [16]:
mapper.fit_transform(data)

   Uni_One  Uni_Three  Uni_Two       Age
0        1          0        0 -0.872025
1        0          0        1 -0.218006
2        0          1        0 -0.093431
3        1          0        0 -1.463755
4        0          0        1 -0.436012
5        0          1        0 -0.280294
6        1          0        0  0.591731
7        0          0        1  0.809737
8        0          1        0 -0.404869
9        1          0        0  2.366924

In [9]:
mapper.transformed_names_

['Uni_One', 'Uni_Three', 'Uni_Two', 'Age']

In [13]:
mapper.df_out

True

AttributeError: 'DataFrameMapper' object has no attribute 'predict'